Revit 2026 API

# IndexStreamTriangle Properties

---

The IndexStreamTriangle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from IndexStream) |

#### Reference

IndexStreamTriangle Class

Autodesk.Revit.DB.DirectContext3D Namespace